src/Documents/Приход/Приход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Приход</name>
  <registerRecords>AccumulationRegister.ОплатыЗаУслуги</registerRecords>
  <attributes>
    <name>НомерГрузовогоМеста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУбытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипГрузовогоМеста</name>
    <type>
      <types>EnumRef.ТипыГрузовогоМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>КодХаба</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/ОплатыЗаУслуги/ОплатыЗаУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОплатыЗаУслуги</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидУслуги</name>
    <type>
      <types>EnumRef.ВидыУслуг</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/ПроизводственныйКалендарь/ПроизводственныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроизводственныйКалендарь</name>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ТарифыНаОбработку/ТарифыНаОбработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыНаОбработку</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипГрузовогоМеста</name>
    <type>
      <types>EnumRef.ТипыГрузовогоМеста</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыУслуг/ВидыУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУслуг</name>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыДнейПроизводственногоКалендаря/ВидыДнейПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДнейПроизводственногоКалендаря</name>
  <enumValues>
    <name>Рабочий</name>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
  <enumValues>
    <name>Предпраздничный</name>
  </enumValues>
  <enumValues>
    <name>Праздник</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Приход/ObjectModule.bsl
Процедура ОбработкаПроведения() 
	
	Движения.ОплатыЗаУслуги.Записывать = Истина;
	Движение = Движения.ОплатыЗаУслуги.Добавить();
	Движение.Период = Дата;
	Движение.ВидУслуги = Перечисления.ВидыУслуг.Хранение;
	Движение.Сумма = ПолучитьОбщуюСтоимостьХранения (ДатаПрибытия, ДатаУбытия, ТипГрузовогоМеста); 
	
    Движения.ОплатыЗаУслуги.Записывать = Истина;
	Движение = Движения.ОплатыЗаУслуги.Добавить();
	Движение.Период = Дата;
	Движение.ВидУслуги = Перечисления.ВидыУслуг.Обработка;
	Движение.Сумма = ПолучитьОбщуюСтоимостьОбработки(ДатаПрибытия, ДатаУбытия, ТипГрузовогоМеста); 
	
	
КонецПроцедуры 

Функция  ПолучитьОбщуюСтоимостьХранения (ДатаПрибытия, ДатаУбытия, ТипГрузовогоМеста)
	
	ОбщаяСтоимостьХранения = 0;
	ОдниСуткиВСекундах = 86400;
	ОбщееВремяНаХраненииВСутках = (ДатаУбытия - ДатаПрибытия)/ОдниСуткиВСекундах;
	
	Если ОбщееВремяНаХраненииВСутках < 1 Тогда  
		//Если меньше суток, то оплату за хранение не выставляем
		Возврат ОбщаяСтоимостьХранения;
	КонецЕсли;	 
	
	ОбщееВремяНаХраненииВДнях = (НачалоДня(ДатаУбытия) - НачалоДня(ДатаПрибытия))/ОдниСуткиВСекундах;
	
	Если ОбщееВремяНаХраненииВСутках < ОбщееВремяНаХраненииВДнях Тогда 
		//Если одни сутки, проведенные на хранении были не полные, тогда за последние сутки счет не выставляем
		ДатаУбытия = ДатаУбытия - ОдниСуткиВСекундах;
	КонецЕсли;
	
	СтоимостьХраненияЗаОдниСутки = Константы.СтоимостьХранения.Получить();
	
	//Если услуги предоставлялись в выходной день, тогда расчет должен производится по двойному тарифу
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
		|				ТОГДА &СтоимостьХранения
		|			ИНАЧЕ 2 * &СтоимостьХранения
		|		КОНЕЦ) КАК Стоимость
		|ИЗ
		|	РегистрСведений.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
		|	Константа.СтоимостьХранения КАК СтоимостьХранения
		|ГДЕ
		|	ПроизводственныйКалендарь.Дата МЕЖДУ &ДатаНачало И &ДатаКонец";
	
	Запрос.УстановитьПараметр("ДатаКонец", ДатаУбытия);
	Запрос.УстановитьПараметр("ДатаНачало", ДатаПрибытия);
	Запрос.УстановитьПараметр("СтоимостьХранения", СтоимостьХраненияЗаОдниСутки);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ОбщаяСтоимостьХранения = ВыборкаДетальныеЗаписи.Стоимость;
	КонецЕсли;
	
	Возврат ОбщаяСтоимостьХранения
	
КонецФункции 

Функция  ПолучитьОбщуюСтоимостьОбработки(ДатаПрибытия, ДатаУбытия, ТипГрузовогоМеста) 
	
	ОбщаяСтоимостьОбработки = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
		|				ТОГДА ТарифыНаОбработкуСрезПоследних.Стоимость
		|			ИНАЧЕ 2 * ТарифыНаОбработкуСрезПоследних.Стоимость
		|		КОНЕЦ) КАК Стоимость
		|ИЗ
		|	РегистрСведений.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыНаОбработку.СрезПоследних КАК ТарифыНаОбработкуСрезПоследних
		|		ПО (НАЧАЛОПЕРИОДА(ПроизводственныйКалендарь.Дата, МЕСЯЦ) = ТарифыНаОбработкуСрезПоследних.Период)
		|ГДЕ
		|	ПроизводственныйКалендарь.Дата МЕЖДУ &ДатаНачало И &ДатаКонец
		|	И ТарифыНаОбработкуСрезПоследних.ТипГрузовогоМеста = &ТипГрузовогоМеста";
	
	Запрос.УстановитьПараметр("ДатаКонец", ДатаУбытия);
	Запрос.УстановитьПараметр("ДатаНачало", ДатаПрибытия);
	Запрос.УстановитьПараметр("ТипГрузовогоМеста", ТипГрузовогоМеста);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ОбщаяСтоимостьОбработки = ВыборкаДетальныеЗаписи.Стоимость;
	КонецЕсли;
	
	Возврат ОбщаяСтоимостьОбработки	
	
КонецФункции
